# Основные протоколы сети интернет

### Выполнение

Лаботаторная схема сети
![img.png](img.png)

1. Настроим NAT(PAT) на R14 и R15. Трансляция осуществляться в адрес автономной системы AS1001.
   ```
   Настройки на R14:
   
   ip nat pool POOL-123.14.14.2 123.14.14.2 123.14.14.2 netmask 255.255.255.0
   ip nat inside source list 10 pool POOL-123.14.14.2 overload
   !
   access-list 10 permit 10.10.101.0 0.0.0.255
   access-list 10 permit 10.10.102.0 0.0.0.255
   !
   ip nat outside на uplink 
   ip nat inside на downlinks
   ``` 
   ```
   Настройки на R15:

   ip nat pool POOL-123.15.15.2 123.15.15.2 123.15.15.2 netmask 255.255.255.0
   ip nat inside source list 10 pool POOL-123.15.15.2 overload
   !
   access-list 10 permit 10.10.101.0 0.0.0.255
   access-list 10 permit 10.10.102.0 0.0.0.255

   ip nat outside на uplink 
   ip nat inside на downlinks
   ```
2. Настроим NAT(PAT) на R18. Трансляция осуществляться в пул из 5 адресов автономной системы AS2042.
   ```
   Настройки на R18:
   
   ip nat pool POOL-123.18.18.2-6 123.18.18.2 123.18.18.6 netmask 255.255.255.0
   ip nat inside source list 10 pool POOL-123.18.18.2-6 overload
   !
   access-list 10 permit 10.20.101.0 0.0.0.255
   access-list 10 permit 10.20.102.0 0.0.0.255
   !
   ip nat outside на uplinks
   ip nat inside на downlinks
   !
   R18# sh ip nat translations
   Pro Inside global      Inside local       Outside local      Outside global
   icmp 123.18.18.3:48671 10.20.101.100:48671 123.24.24.1:48671 123.24.24.1:48671
   icmp 123.18.18.3:48927 10.20.101.100:48927 123.24.24.1:48927 123.24.24.1:48927
   icmp 123.18.18.3:49183 10.20.101.100:49183 123.24.24.1:49183 123.24.24.1:49183
   icmp 123.18.18.3:49439 10.20.101.100:49439 123.24.24.1:49439 123.24.24.1:49439
   icmp 123.18.18.3:49695 10.20.101.100:49695 123.24.24.1:49695 123.24.24.1:49695
   icmp 123.18.18.3:46111 10.20.102.100:46111 123.24.24.1:46111 123.24.24.1:46111
   icmp 123.18.18.3:46367 10.20.102.100:46367 123.24.24.1:46367 123.24.24.1:46367
   icmp 123.18.18.3:46623 10.20.102.100:46623 123.24.24.1:46623 123.24.24.1:46623
   icmp 123.18.18.3:46879 10.20.102.100:46879 123.24.24.1:46879 123.24.24.1:46879
   icmp 123.18.18.3:47135 10.20.102.100:47135 123.24.24.1:47135 123.24.24.1:47135
   
   R18# debug ip nat
   IP NAT debugging is on
   *Feb 12 13:45:47.368: NAT*: s=10.20.101.100->123.18.18.3, d=123.24.24.1 [8459]
   *Feb 12 13:45:47.369: NAT*: s=123.24.24.1, d=123.18.18.3->10.20.101.100 [8459]
   *Feb 12 13:45:48.372: NAT*: s=10.20.101.100->123.18.18.3, d=123.24.24.1 [8460]
   *Feb 12 13:45:48.373: NAT*: s=123.24.24.1, d=123.18.18.3->10.20.101.100 [8460]
   *Feb 12 13:45:49.374: NAT*: s=10.20.101.100->123.18.18.3, d=123.24.24.1 [8461]
   *Feb 12 13:45:49.375: NAT*: s=123.24.24.1, d=123.18.18.3->10.20.101.100 [8461]
   *Feb 12 13:45:50.378: NAT*: s=10.20.101.100->123.18.18.3, d=123.24.24.1 [8462]
   *Feb 12 13:45:50.379: NAT*: s=123.24.24.1, d=123.18.18.3->10.20.101.100 [8462]
   *Feb 12 13:45:51.381: NAT*: s=10.20.101.100->123.18.18.3, d=123.24.24.1 [8463]
   *Feb 12 13:45:51.382: NAT*: s=123.24.24.1, d=123.18.18.3->10.20.101.100 [8463]
   *Feb 12 13:45:59.013: NAT*: s=10.20.102.100->123.18.18.3, d=123.24.24.1 [8471]
   *Feb 12 13:45:59.014: NAT*: s=123.24.24.1, d=123.18.18.3->10.20.102.100 [8471]
   *Feb 12 13:46:00.016: NAT*: s=10.20.102.100->123.18.18.3, d=123.24.24.1 [8472]
   *Feb 12 13:46:00.016: NAT*: s=123.24.24.1, d=123.18.18.3->10.20.102.100 [8472]
   *Feb 12 13:46:01.019: NAT*: s=10.20.102.100->123.18.18.3, d=123.24.24.1 [8473]
   *Feb 12 13:46:01.020: NAT*: s=123.24.24.1, d=123.18.18.3->10.20.102.100 [8473]
   *Feb 12 13:46:02.022: NAT*: s=10.20.102.100->123.18.18.3, d=123.24.24.1 [8474]
   *Feb 12 13:46:02.023: NAT*: s=123.24.24.1, d=123.18.18.3->10.20.102.100 [8474]
   *Feb 12 13:46:03.025: NAT*: s=10.20.102.100->123.18.18.3, d=123.24.24.1 [8475]
   *Feb 12 13:46:03.026: NAT*: s=123.24.24.1, d=123.18.18.3->10.20.102.100 [8475]
   ```
3. Настроим статический NAT для R20.
   ```
   Настройки на R14 и R15:
   
   ip nat inside source static 10.10.0.20 123.15.15.7
   
   Проверяем:
   
   R20# ping 123.22.22.1 source l0
   Type escape sequence to abort.
   Sending 5, 100-byte ICMP Echos to 123.22.22.1, timeout is 2 seconds:
   Packet sent with a source address of 10.10.0.20
   !!!!!
   R14# debug ip nat
   IP NAT debugging is on
   *Feb 12 15:07:41.317: NAT*: s=10.10.0.20->123.15.15.7, d=123.22.22.1 [122]
   *Feb 12 15:07:41.318: NAT*: s=123.22.22.1, d=123.15.15.7->10.10.0.20 [122]
   *Feb 12 15:07:41.319: NAT*: s=10.10.0.20->123.15.15.7, d=123.22.22.1 [123]
   *Feb 12 15:07:41.320: NAT*: s=123.22.22.1, d=123.15.15.7->10.10.0.20 [123]
   *Feb 12 15:07:41.321: NAT*: s=10.10.0.20->123.15.15.7, d=123.22.22.1 [124]
   *Feb 12 15:07:41.321: NAT*: s=123.22.22.1, d=123.15.15.7->10.10.0.20 [124]
   *Feb 12 15:07:41.322: NAT*: s=10.10.0.20->123.15.15.7, d=123.22.22.1 [125]
   *Feb 12 15:07:41.323: NAT*: s=123.22.22.1, d=123.15.15.7->10.10.0.20 [125]
   *Feb 12 15:07:41.324: NAT*: s=10.10.0.20->123.15.15.7, d=123.22.22.1 [126]
   *Feb 12 15:07:41.325: NAT*: s=123.22.22.1, d=123.15.15.7->10.10.0.20 [126]

   R20# ping 123.21.21.1 source l0
   Type escape sequence to abort.
   Sending 5, 100-byte ICMP Echos to 123.21.21.1, timeout is 2 seconds:
   Packet sent with a source address of 10.10.0.20
   !!!!!
   R15# debug ip nat
   IP NAT debugging is on
   *Feb 12 15:12:02.113: NAT*: s=10.10.0.20->123.15.15.7, d=123.21.21.1 [157]
   *Feb 12 15:12:02.114: NAT*: s=123.21.21.1, d=123.15.15.7->10.10.0.20 [157]
   *Feb 12 15:12:02.115: NAT*: s=10.10.0.20->123.15.15.7, d=123.21.21.1 [158]
   *Feb 12 15:12:02.115: NAT*: s=123.21.21.1, d=123.15.15.7->10.10.0.20 [158]
   *Feb 12 15:12:02.116: NAT*: s=10.10.0.20->123.15.15.7, d=123.21.21.1 [159]
   *Feb 12 15:12:02.116: NAT*: s=123.21.21.1, d=123.15.15.7->10.10.0.20 [159]
   *Feb 12 15:12:02.117: NAT*: s=10.10.0.20->123.15.15.7, d=123.21.21.1 [160]
   *Feb 12 15:12:02.117: NAT*: s=123.21.21.1, d=123.15.15.7->10.10.0.20 [160]
   *Feb 12 15:12:02.118: NAT*: s=10.10.0.20->123.15.15.7, d=123.21.21.1 [161]
   *Feb 12 15:12:02.118: NAT*: s=123.21.21.1, d=123.15.15.7->10.10.0.20 [161]
   ```
4. Настроим NAT так, чтобы R19 был доступен с любого узла для удаленного управления.
   ```
   Настройки на R14 и R15:
   
   ip nat inside source static tcp 10.10.0.19 23 123.14.14.7 23 extendable
   
   Проверяем:
   
   R22# telnet 123.14.14.7 /source-interface l1
   !
   Trying 123.14.14.7 ... Open
   User Access Verification
   Password:
   R19>exit
   [Connection to 123.14.14.7 closed by foreign host]
   
   R14# sh ip nat translations
   Pro Inside global      Inside local       Outside local      Outside global
   tcp 123.14.14.7:23     10.10.0.19:23      123.22.22.1:38448  123.22.22.1:38448

   R21#telnet 123.14.14.7 /source-interface l1
   !
   Trying 123.14.14.7 ... Open
   User Access Verification
   Password:
   R19>exit
   [Connection to 123.14.14.7 closed by foreign host]

   R15# sh ip nat translations
   Pro Inside global      Inside local       Outside local      Outside global
   tcp 123.14.14.7:23     10.10.0.19:23      123.21.21.1:36627  123.21.21.1:36627
   ```
5. Настроите статический NAT(PAT) для офиса Чокурдах.*
   ```
   Выделим в Триаде сеть /30 и смаршрутизируем её в сторону Чокурдах через оба линка
   
   R25: ip route 123.25.25.4 255.255.255.252 10.0.0.18
   R26: ip route 123.25.25.4 255.255.255.252 10.0.0.21
   
   После чего настроим статический NAT(PAT) на R28 для 2-х хостов из выделенного пула

   ip nat inside source static 10.70.101.100 123.25.25.5
   ip nat inside source static 10.70.102.100 123.25.25.6

   R28# sh ip nat translations
   Pro Inside global      Inside local       Outside local      Outside global
   --- 123.25.25.5        10.70.101.100      ---                ---
   --- 123.25.25.6        10.70.102.100      ---                ---

   R28# sh ip nat translations
   Pro Inside global      Inside local       Outside local      Outside global
   icmp 123.25.25.5:715   10.70.101.100:715  123.24.24.1:715    123.24.24.1:715
   icmp 123.25.25.5:971   10.70.101.100:971  123.24.24.1:971    123.24.24.1:971
   icmp 123.25.25.5:1227  10.70.101.100:1227 123.24.24.1:1227   123.24.24.1:1227
   icmp 123.25.25.5:1483  10.70.101.100:1483 123.24.24.1:1483   123.24.24.1:1483
   icmp 123.25.25.5:1739  10.70.101.100:1739 123.24.24.1:1739   123.24.24.1:1739
   --- 123.25.25.5        10.70.101.100      ---                ---
   icmp 123.25.25.6:62922 10.70.102.100:62922 123.24.24.1:62922 123.24.24.1:62922
   icmp 123.25.25.6:63178 10.70.102.100:63178 123.24.24.1:63178 123.24.24.1:63178
   icmp 123.25.25.6:63434 10.70.102.100:63434 123.24.24.1:63434 123.24.24.1:63434
   icmp 123.25.25.6:63690 10.70.102.100:63690 123.24.24.1:63690 123.24.24.1:63690
   icmp 123.25.25.6:63946 10.70.102.100:63946 123.24.24.1:63946 123.24.24.1:63946
   --- 123.25.25.6        10.70.102.100      ---                ---
   ```
5. Настроим для IPv4 DHCP сервер в офисе Москва на маршрутизаторах R12 и R13. VPC1 и VPC7 получают сетевые настройки по DHCP.
   ```
   Настраиваем dhcp pool:
   
   R12# sh run | sec ip dhcp
   ip dhcp excluded-address 10.10.101.1
   ip dhcp pool POOL-10.10.101.0_24
   network 10.10.101.0 255.255.255.0
   default-router 10.10.101.1
   lease 2 12 30

   R13# sh run | sec ip dhcp
   ip dhcp excluded-address 10.10.102.1
   ip dhcp pool POOL-10.10.102.0_24
   network 10.10.102.0 255.255.255.0
   default-router 10.10.102.1
   lease 2 12 30

   На интерфейса в сторону клиентов указываем ip helper-address:
   
   ip helper-address 10.10.0.12 [для сети 10.10.101.0/24]
   ip helper-address 10.10.0.13 [для сети 10.10.102.0/24]
   
   Проверяем:
   
   VPCS1> ip dhcp
   DORA IP 10.10.101.4/24 GW 10.10.101.1

   VPCS7> ip dhcp
   DORA IP 10.10.102.4/24 GW 10.10.102.1
   ```
6. Настроиь NTP сервер на R12 и R13. Все устройства в офисе Москва синхронизируют время с R12 и R13.
   ```
   Настраиваем NTP SERVER:
   
   R12: ntp master 2
   R13: ntp master 3
   
   На клиентах:
   
   ntp server 10.10.0.12 source Loopback0
   ntp server 10.10.0.13 source Loopback0
   
   Проверяем:
   
   SW4# show clock detail
   10:35:09.925 UTC Thu Feb 15 2024
   Time source is NTP

   SW4# sh ntp associations
   address         ref clock       st   when   poll reach  delay  offset   disp
   *~10.10.0.12      127.127.1.1      2     19     64    77  1.000  -0.500  3.749
   +~10.10.0.13      127.127.1.1      3     20     64    77  0.000  -1.000  6.027
   * sys.peer, # selected, + candidate, - outlyer, x falseticker, ~ configured

   SW4# show ntp status
   Clock is synchronized, stratum 3, reference is 10.10.0.12
   nominal freq is 250.0000 Hz, actual freq is 250.0000 Hz, precision is 2**10
   ntp uptime is 46200 (1/100 of seconds), resolution is 4000
   reference time is E9786760.0E147B08 (10:35:12.055 UTC Thu Feb 15 2024)
   clock offset is -0.5000 msec, root delay is 1.00 msec
   root dispersion is 8.60 msec, peer dispersion is 3.74 msec
   loopfilter state is 'CTRL' (Normal Controlled Loop), drift is -0.000000008 s/s
   system poll interval is 64, last update was 52 sec ago.
   ```